src/blog/miscelanea-sobre-web-y-redes-sociales.org
---
layout: post
title: "Miscelánea sobre web y redes sociales"
date: 2023-08-30
tags: [web, software, utopías]
share-img: mastodon.jpeg
image: mastodon.jpeg
thumbnail-img: mastodon.jpeg
excerpt: La proliferación de aplicaciones federadas con ActivityPub, el renovado interés en los lectores RSS y los esfuerzos de la web indie son miniaturas de un proyecto de desmantelar las plataformas monopólicas mediante el uso de tecnología abierta.
lang: es
refs: [indie, garden, indiereader, protocols, local]
---
#+OPTIONS: toc:nil num:nil
#+LANGUAGE: es

#+begin_verse
Quien no extraña la vieja web no tiene corazón,
quien la quiere de vuelta no tiene cerebro.

Vladimir Putin
#+end_verse

#+begin_export html
<br/>
#+end_export

** 1: Enmierdización

   #+begin_quote
Here is how platforms die: first, they are good to their users; then they abuse their users to make things better for their business customers; finally, they abuse those business customers to claw back all the value for themselves. Then, they die.
   #+end_quote

Alguna vez dije que la solución a la crisis de la balanza de pagos era empezar a exportar memes. (Eso y monetizar a los argentinos notables; digamos: cobrarle retenciones a Messi, derechos formativos a Bergoglio). Porque da gusto ver cómo inventan los argentinos, mártires cínicos,  perfectos violinistas para cualquier Titanic. Cuando Elon Musk compró Twitter, recé para que no lo rompiera antes del Mundial: Qatar puede no haber sido el [[file:justicia-poetica/][fin del fútbol]], pero sí que fue el /last dance/ de Tuiter Argentina.

Cory Doctorow acuñó el termino /enshittification/ para designar el ciclo en que las redes sociales pasan de la masividad a una degradación que en algunos casos llega a ser terminal. El artículo, de enero, venía a cuento de algunos cambios en TikTok pero tuvo el timing perfecto para anticiparse al declive de Twitter ---que había empezado antes pero se acentuó semanas después--- y al de Reddit que, en medio del [[file:la-era-de-la-boludez][hype por la inteligencia artificial]], cerró el acceso a las APIs para aplicaciones externas, reservándose el derecho exclusivo de explotar a su comunidad como carne de algoritmo. El término parece haberse puesto de moda para referir al malestar generalizado que produce la web moderna.

*** Fuentes
     - [[https://pluralistic.net/2023/01/21/potemkin-ai/#hey-guys][Tiktok's enshittification]].

#+begin_export html
<br/>
#+end_export


** 2: La Fede

Twitter se enmierdizó y fue mi excusa para desmantelar mi cuenta y probar [[https://joinmastodon.org/][Mastodon]]. Anoto algunas cosas que me llamaron la atención después de unas semanas en el /fediverso/.

El ritmo es más lento: la gente se loguea con menos frecuencia, postea esporádicamente, los posts tardan más en propagarse, las reacciones llegan con delay. Se siente un poco como los foros de antes: en vez de recibir un torrente de novedades, voy cada tanto a buscarlas, a ver qué hay de nuevo.

El mayor control sobre el feed cambia profundamente la experiencia de usuario. No sólo porque los posts llegan cronológicamente, sin mediación de "algoritmos" tratando de manipular mi atención o venderme cosas, sino porque Mastodon te da muchas opciones para elegir qué incluir en el timeline: ocultar replies o retweets, desactivar las actualizaciones en vivo, seguir hashtags, silenciar cuentas, crear filtros.

Hay que decir que el Mastodon /realmente existente/ es menos descentralizado de lo que permite su tecnología, no resuelve del todo los problemas de las redes masivas. La mayoría de los usuarios se concentra en dos o tres servidores; el proceso de migración es engorroso y los posts son intransferibles; los usuarios, en última instancia, tienen que confiar en algún administrador o asumir el trabajo de convertirse en uno. Y están a merced de perder los datos si la instancia se cae o a quedar aislados si es bloqueada por otras. Pero mientras que las aplicaciones /peer to peer/ son un ideal de difícil realización, la federación a través del protocolo ActivityPub es un
[[file:worse-is-better-is-worse-is-better][/Worse is Better/]] de las redes sociales: la alternativa que estuvo en mejores condiciones de asilar a las sucesivas olas de refugiados de Twitter.

Elegir un server de Mastodon se parece a elegir una distribución de Linux. Y aunque la federación en la práctica tenga sus problemas, hay todo un triunfo en este despliegue global de una red de aplicaciones interoperables. Así como los programas de Linux funcionan sin grandes cambios entre distribuciones e incluso en otras variantes de Unix, así los usuarios del fediverso pueden hablar entre sí sin importar si su cuenta reside en una aplicación de [[https://micro.blog/][microblogging]], de [[https://pixelfed.org][fotos]], de [[https://joinpeertube.org][videos]], de [[https://joinbookwyrm.com/][libros]], de [[https://join-lemmy.org/][links]]. Eso ya implica un cambio de paradigma, una demostración de alternativas y futuros posibles.

