_posts/2023-08-30-miscelanea-sobre-web-y-redes-sociales.html
---
layout: post
title: "Miscelánea sobre web y redes sociales"
date: 2023-08-30
tags: [software, utopías]
share-img: assets/img/mastodon.jpeg
thumbnail-img: assets/img/mastodon.jpeg
excerpt: La proliferación de aplicaciones federadas con ActivityPub, el renovado interés en los lectores RSS y los esfuerzos de la web indie son miniaturas de un proyecto de desmantelar las plataformas monopólicas mediante el uso de tecnología abierta.
---

<p class="verse">
Quien no extraña la vieja web no tiene corazón,<br />
quien la quiere de vuelta no tiene cerebro.<br />
<br />
Vladimir Putin<br />
</p>

<p>
<br />
</p>

<div id="outline-container-orga7144de" class="outline-2">
<h2 id="orga7144de">1: Enmierdización</h2>
<div class="outline-text-2" id="text-orga7144de">
<blockquote>
<p>
Here is how platforms die: first, they are good to their users; then they abuse their users to make things better for their business customers; finally, they abuse those business customers to claw back all the value for themselves. Then, they die.
</p>
</blockquote>

<p>
Alguna vez dije que la solución a la crisis de la balanza de pagos era empezar a exportar memes. (Eso y monetizar a los argentinos notables; digamos: cobrarle retenciones a Messi, derechos formativos a Bergoglio). Porque da gusto ver cómo inventan los argentinos, mártires cínicos,  perfectos violinistas para cualquier Titanic. Cuando Elon Musk compró Twitter, recé para que no lo rompiera antes del Mundial: Qatar puede no haber sido el <a href="../2023-02-06-justicia-poetica/">fin del fútbol</a>, pero sí que fue el <i>last dance</i> de Tuiter Argentina.
</p>

<p>
Cory Doctorow acuñó el termino <i>enshittification</i> para designar el ciclo en que las redes sociales pasan de la masividad a una degradación que en algunos casos llega a ser terminal. El artículo, de enero, venía a cuento de algunos cambios en TikTok pero tuvo el timing perfecto para anticiparse al declive de Twitter &#x2014;que había empezado antes pero se acentuó semanas después&#x2014; y al de Reddit que, en medio del <a href="../2023-07-10-la-era-de-la-boludez">hype por la inteligencia artificial</a>, cerró el acceso a las APIs para aplicaciones externas, reservándose el derecho exclusivo de explotar a su comunidad como carne de algoritmo. El término parece haberse puesto de moda para referir al malestar generalizado que produce la web moderna.
</p>
</div>

<div id="outline-container-org795576c" class="outline-3">
<h3 id="org795576c">Fuentes</h3>
<div class="outline-text-3" id="text-org795576c">
<ul class="org-ul">
<li><a href="https://pluralistic.net/2023/01/21/potemkin-ai/#hey-guys">Tiktok's enshittification</a>.</li>
</ul>

<p>
<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgbc0eb68" class="outline-2">
<h2 id="orgbc0eb68">2: La Fede</h2>
<div class="outline-text-2" id="text-orgbc0eb68">
<p>
Twitter se enmierdizó y fue mi excusa para desmantelar mi cuenta y probar <a href="https://joinmastodon.org/">Mastodon</a>. Anoto algunas cosas que me llamaron la atención después de unas semanas en el <i>fediverso</i>.
</p>

<p>
El ritmo es más lento: la gente se loguea con menos frecuencia, postea esporádicamente, los posts tardan más en propagarse, las reacciones llegan con delay. Se siente un poco como los foros de antes: en vez de recibir un torrente de novedades, voy cada tanto a buscarlas, a ver qué hay de nuevo.
</p>

<p>
El mayor control sobre el feed cambia profundamente la experiencia de usuario. No sólo porque los posts llegan cronológicamente, sin mediación de "algoritmos" tratando de manipular mi atención o venderme cosas, sino porque Mastodon te da muchas opciones para elegir qué incluir en el timeline: ocultar replies o retweets, desactivar las actualizaciones en vivo, seguir hashtags, silenciar cuentas, crear filtros.
</p>

<p>
Hay que decir que el Mastodon <i>realmente existente</i> es menos descentralizado de lo que permite su tecnología, no resuelve del todo los problemas de las redes masivas. La mayoría de los usuarios se concentra en dos o tres servidores; el proceso de migración es engorroso y los posts son intransferibles; los usuarios, en última instancia, tienen que confiar en algún administrador o asumir el trabajo de convertirse en uno. Y están a merced de perder los datos si la instancia se cae o a quedar aislados si es bloqueada por otras. Pero mientras que las aplicaciones <i>peer to peer</i> son un ideal de difícil realización, la federación a través del protocolo ActivityPub es un
<a href="../2023-02-22-worse-is-better-is-worse-is-better"><i>Worse is Better</i></a> de las redes sociales: la alternativa que estuvo en mejores condiciones de asilar a las sucesivas olas de refugiados de Twitter.
</p>

<p>
Elegir un server de Mastodon se parece a elegir una distribución de Linux. Y aunque la federación en la práctica tenga sus problemas, hay todo un triunfo en este despliegue global de una red de aplicaciones interoperables. Así como los programas de Linux funcionan sin grandes cambios entre distribuciones e incluso en otras variantes de Unix, así los usuarios del fediverso pueden hablar entre sí sin importar si su cuenta reside en una aplicación de <a href="https://micro.blog/">microblogging</a>, de <a href="https://pixelfed.org">fotos</a>, de <a href="https://joinpeertube.org">videos</a>, de <a href="https://joinbookwyrm.com/">libros</a>, de <a href="https://join-lemmy.org/">links</a>. Eso ya implica un cambio de paradigma, una demostración de alternativas y futuros posibles.
</p>
</div>
