src/blog/miscelanea-sobre-web-y-redes-sociales.org
*** Fuentes
   - [[https://www.theverge.com/2023/4/20/23689570/activitypub-protocol-standard-social-network][Can ActivityPub save the internet?]]
   - [[https://medium.com/decentralized-web/decentralized-social-networks-e5a7a2603f53][Decentralized Social Networks]].
   - [[https://rosenzweig.io/blog/the-federation-fallacy.html][The Federation Fallacy]].
   - [[https://erinkissane.com/mastodon-is-easy-and-fun-except-when-it-isnt][Mastodon is easy and fun except when it isn’t]].
   - [[https://erinkissane.com/notes-from-a-mastodon-migration][Notes from a Mastodon migration]].

#+begin_export html
<br/>
#+end_export


** 3: Otras webs

#+begin_quote
Do we want the web to be open, accessible, empowering and collaborative? Free, in the spirit of  the open source tools it's built on? Or do we want it to be just another means of endless consumption, where people become eyeballs, targets and profiles? Where companies use your data to control your behaviour and which enables a surveillance society—what do we want?
#+end_quote

En Mastodon y en el fediverso sobran programadores frustrados con las redes sociales, con el estado de la web y la industria del software en general. (Me cuento entre ellos). No es una sorpresa considerando: a) el perfil de usuario que opta por un nicho descentralizado, y b) la complejidad técnica de elegir una instancia y encontrar contenido.

Sí llama la atención cómo muchos canalizan esa frustración en una especie de retorno a las fuentes, estudiando los hábitos y tecnologías de la vieja web, los /Bulletin Board Systems/, los feeds RSS. Aunque no estén exentas de cierta nostalgia y romantización del pasado, estas exploraciones intentan encontrar en viejas ideas formas de resistir o superar una crisis que ya es difícil de disimular y que amenaza con profundizarse.

Hay que hacer mucho trabajo para recobrar algo de aquella sensación de exploración y descubrimiento que generaba "navegar" en internet. La web se convirtió hace años en un corralito que se va cerrando alrededor nuestro, un cerco de paywalls y ads y popups de consentimiento, de solicitudes de registro y de suscripciones. La vieja web supo ser una vía de escape del mundo real, un espacio motorizado más por la curiosidad y la creatividad que por el consumo; la web moderna es aquello de lo que necesitamos refugiarnos.

Como en cualquier conjunto de anticapitalistas, pareciera que en el fediverso cada uno se dispone, a su manera, a cambiar el mundo: administrando una instancia de Mastodon o desarrollando una nueva app federada o un protocolo, o simplemente escribiendo un manifiesto para reinventar la web. Los hay revisando el rol que jugaron los blogs en reemplazar a los sitios personales por cronologías de contenidos; los hay buscando en las wikis y las metáforas botánicas una alternativa a los ríos de la información; los hay liderando comunidades devenidas movimientos contraculturales. De todas esas derivas, la que más me interesó fue la de la [[https://indieweb.org][/web indie/]].

El objetivo de la web indie es devolverle a los usuarios el control de su identidad online, de sus datos y de su experiencia de la web. En un mundo ideal, cada persona tendría un dominio propio, que funcionaría como identificación: en vez de perfiles separados en las corporaciones (~twitter.com/@olano~, ~github.com/olano~, ~olano@gmail.com~, etc), tendría un perfil unificado en su sitio web (por ejemplo: ~olano.com~). Esto no implica eliminar la participación en las redes corporativas sino convertirlas en medios subsidiarios: el contenido se publica primero en el sitio personal y se reproduce (y linkea) en los demás.


Los promotores de la web indie ofrecen tecnologías y protocolos para mantener la funcionalidad de las redes sociales, sin ceder el control de los datos: seguir a otras personas, comentar, compartir e interactuar con su contenido sin necesidad de participar de una misma plataforma. Son herramientas complicadas de ensamblar hasta para un usuario técnico, menos un ejemplo a seguir que una prueba de concepto: una demostración de que las alternativas son posibles. La visión es ponerlas al alcance de cualquier usuario.

*** Fuentes
   - [[https://neustadt.fr/essays/against-a-user-hostile-web/][Against an Increasingly User-Hostile web]].
   - [[https://sadgrl.online/cyberspace/modern-web][A Case Against Today's Internet]].
   - [[https://devon.lol/blog/the-old-web/][The Old web]].
   - [[https://stackingthebricks.com/how-blogs-broke-the-web/][How the Blog Broke the web]].
   - [[https://hapgood.us/2015/10/17/the-garden-and-the-stream-a-technopastoral/][The Garden and the Stream: A Technopastoral]].
   - [[https://slate.com/technology/2014/04/indiewebcamps-create-tools-for-a-new-internet.html][Welcome to the indie web Movement]].
   - [[https://www.jvt.me/posts/2019/10/20/indieweb-talk/][The indieweb Movement: Owning Your Data and Being the Change You Want to See in the web]].

#+begin_export html
<br/>
#+end_export


