src/blog/miscelanea-sobre-web-y-redes-sociales.org
** 4: RSS as in reinassance

   #+begin_quote
What if you could reply to a blog post in your feed reader, and your reply would show up as a comment on the original post automatically? What if you could click a “heart” in your reader, and the author of the post would see it? What if you had one place to go to follow not just your Twitter friends, but also all of your friends’ blogs, their microblogs, and see the pictures they’re sharing? What if you could have seamless conversations in your reader the way you have seamless conversations on Twitter today?
   #+end_quote

Aunque Mastodon no sea una corporación chupasangre ni esté gestionado por un supervillano de Silicon Valley, en el fondo sigue siendo un clon de Twitter que trafica en seguidores, likes y notificaciones. Y aunque encontré ahí personas e ideas valiosas y aprendí algunas cosas sobre mis consumos de información, me siguen incomodando el frenesí del microblogging, el drama y el flujo constante de trivialidades que estimula. Prefiero la cadencia más reflexiva de los blogs.

Me di cuenta de que estaba siguiendo a personas solo para enterarme cuándo publicaban en sus sitios y a bots para ahorrame entrar a lobste.rs o hackernews a buscar noticias tecnológicas. Es decir que usaba Mastodon, y antes Twitter, menos como una red social que como un condensador de información. Y la verdad es que ninguno de los dos es la herramienta que mejor se adecúa a esa función. Para eso están los lectores [[https://aboutfeeds.com/][RSS]].

Los feeds RSS nunca desaparecieron, pese al mito urbano de que el cierre de Google Reader los mató. De hecho llama la atención la cantidad de diarios, revistas y blogs que todavía ofrecen su contenido por ese medio, acaso sin saberlo. Si obviamos el aspecto "social" de los medios digitales, es muy fácil recuperar el control de nuestra vida online usando herramientas como Feedly, Inoreader, FreshRSS o Tiny Tiny RSS. Antes de que Elon se ponga la gorra, esos servicios ofrecían incluso integración con Twitter, para eludir completamente la lógica tóxica del feed "curado" de la red social. (Mastodon no solo tiene una API pública sino que las actualizaciones de cada usuario y cada hashtag están expuestos como un feed RSS).

Terminé de convencerme de que los feeds eran una opción viable para mi cuando leí sobre los /indie web readers/. Los lectores indie son como la evolución de RSS: una mezcla entre Google Reader y feed de Twitter, una red social para armar. Además de unificar el punto de consumo de las distintas fuentes de la web, permiten interactuar con el contenido (darle like, comentar, retweetear) sin salir de la aplicación. Los protocolos de la web indie, además, separan el problema de integrar las fuentes de información del diseño de la aplicación de lectura.

Aunque el concepto es interesante, la implementación de un lector indie es demasiado complicada para el tipo de uso que yo hago de la web. No me molesta abrir un tab en el navegador cuando ocasionalmente quiero dejar un comentario en Mastodon o en lobste.rs. Pero la idea menos ambiciosa de diseñar un lector ergonómico, arbitrariamente configurable, aprovechando la ubicuidad de RSS, me parece un proyecto ideal para reconciliarme con lo bueno y lo bello de la web.


*** Fuentes
   - [[https://www.theverge.com/23778253/google-reader-death-2013-rss-social][Who killed Google Reader?]]
   - [[https://atthis.link/blog/2021/rss.html][Why I Still Use RSS]].
   - [[https://aaronparecki.com/2018/04/20/46/indieweb-reader-my-new-home-on-the-internet][An IndieWeb reader: My new home on the internet]].

#+begin_export html
<br/>
#+end_export


