_posts/2023-08-30-miscelanea-sobre-web-y-redes-sociales.html

<div id="outline-container-org0ce8cd6" class="outline-2">
<h2 id="org0ce8cd6">5: Protocolos sí, plataformas no</h2>
<div class="outline-text-2" id="text-org0ce8cd6">
<blockquote>
<p>
Moving us back toward a world where protocols are dominant over platforms could be of tremendous benefit to free speech and innovation online. Such a move has the potential to return us to the early promise of the web: to create a place where like-minded people can connect on various topics around the globe and anyone can discover useful information on a variety of different subjects without it being polluted by abuse and disinformation.
</p>
</blockquote>

<p>
La proliferación de aplicaciones federadas con ActivityPub, el renovado interés en los lectores RSS y los esfuerzos de la web indie son miniaturas de un proyecto de desmantelar las plataformas monopólicas mediante el uso de tecnología abierta, un proyecto que Mike Masnick expresó muy bien en su artículo de 2019.
</p>

<p>
La vieja web funcionaba alrededor de un conjunto de protocolos abiertos: TCP/IP para la comunicación, HTTP para la web, IMAP, POP3 y SMTP para los mails, IRC y XMPP para el chat.
Esos protocolos funcionaban bien para los usuarios pero no ofrecían muchas oportunidades de explotación económica. La solución de la web 2.0 fue la que Cory Doctorow describe en su ciclo de enmierdización: crear plataformas cerradas alrededor de los protocolos (Facebook, Twitter, Whatsapp), tentar a los usuarios con mejor funcionalidad que las versiones abiertas y, una vez que los tenían "rehenes", aprovechar económicamente el monopolio (usualmente acumulando datos para vender ads).
</p>

<p>
El texto de Masnick se enfoca en el problema de la libertad de expresión en la web actual. Según el autor, las plataformas crecieron tanto en tamaño e influencia que pasaron a tener ciertas "responsabilidades civiles" que no están en condiciones de cumplir: se espera que prevengan los discursos de odio y la desinformación pero que no caigan en la censura y la vigilancia, todo mientras satisfacen a los accionistas que financiaron aquel crecimiento. El resultado es que el costo de moderación de contenido es cada vez más alto, la vigilancia y la explotación de los usuarios es cada vez más agresiva y nadie está contento. Masnick propone una solución técnica: volver a un mundo protocolos, como el de la vieja web:
</p>

<blockquote>
<p>
While there would be specific protocols for the various types of platforms we see today, there would then be many competing interface implementations of that protocol. The lowered switching costs of moving from one implementation to another would create less lock-in, and the ability for anyone to create their own interface and get access to all of the content and users on the underlying protocol makes the barriers to entry for competition drastically lower. You don’t need to build an entirely new Facebook if you already have access to everyone making use of the “social network protocol” and just provide a different, or better, interface to it.
</p>
</blockquote>

<p>
En ese mundo, en vez de redes aisladas como Facebook, Reddit y Twitter, existiría un "protocolo de red social" (que me imagino parecido al ActivityPub del fediverso) y muchas implementaciones de interfaces compitiendo entre sí. Podría haber interfaces que garanticen determinadas formas de control de contenido o determinada experiencia de usuario, por ejemplo diseñadas para contenido audiovisual o para lectura de noticias o para chatear. Los usuarios podrían elegir, cambiar y combinar interfaces sin perder a sus contactos y los implementadores de interfaces, que ocuparían el lugar actual de las plataformas, tendrían incentivos para ofrecer un mejor producto:
</p>

<blockquote>
<p>
End users would still be able to make use of their own data for various social media tools, but rather than having that data locked up in opaque silos with no access, no transparency, and no control, the control would be moved entirely to the end users. The intermediaries are incentivized to be on their best behavior to avoid being cut off.
</p>
</blockquote>

<p>
Esta idea de "invertir el control" y devolverle sus datos a los usuarios tiene mucho en común con los principios del <i>local-first software</i>, un proyecto liderado por Martin Kleppmann que propone alcanzar un balance entre la conveniencia de las plataformas en la nube, y la eficiencia y longevidad de los programas tradicionales "offline".
</p>

<p>
En los últimos 15 años, con el mayor acceso a internet y la proliferación de las computadoras móviles, nos fuimos acostumbrando a que el software pase del escritorio al navegador y del navegador a la app móvil, a que los datos pasen de nuestro disco rígido a la nube, a que el software que antes comprábamos (o no) sea ahora un servicio al que nos tenemos que suscribir. Y lo que pagamos en esa transacción (entregando plata o privacidad) es conveniencia: no tener que bajar o instalar programas, poder usar nuestra cuenta de Google para todo, no preocuparnos por hacer backups o compartir archivos entre personas o sincronizar nuestros varios dispositivos. Pero, quizás sin darnos cuenta, perdimos en esa transición muchas cosas que dábamos por sentadas: ahora cualquier acción tarda más porque tiene que pasar por el servidor, perdemos el acceso al software y los datos cuando no tenemos internet, vivimos expuestos a que el servicio se caiga o que cambien los precios o los términos de uso. O que la empresa se funda porque Amazon copió su servicio, o que la compre Google y decida que al cabo que ni quería mantener ese producto.
</p>

<p>
La propuesta del local-first es tener lo mejor de los dos mundos: que el usuario sea dueño y tenga acceso para siempre al software y a los datos, y que el servidor ejerza apenas un rol de soporte, de intercambio y sincronización de datos. Aunque el foco esté puesto en la experiencia de usuario y la colaboración en tiempo real, buena parte de la tecnología necesaria para ejecutar el proyecto local-first contribuye al plan de reemplazar las plataformas con protocolos. En ambos casos el control está en los márgenes de la red, en manos de los usuarios, y la nube provee un servicio que no puede trastocarse en monopolio.
</p>

<div class="org-center">
<p>
&lowast; &lowast; &lowast;
</p>
</div>


<p>
En vista de las continuas burradas de Elon Musk, del creciente desencanto con las plataformas &#x2014;esa enmierdización que ya salpica hasta a los usuarios menos sofisticados&#x2014;, de la viabilidad del fediverso y el supuesto interés de Tumblr y Facebook de integrarse a ActivityPub, es tentador suspender la incredulidad y pensar que ese mundo de protocolos en vez de plataformas está un poco más cerca que algunos años atrás. Que todavía queda espacio para construir una web más humana.
</p>
</div>
