src/blog/miscelanea-sobre-web-y-redes-sociales.org
*** Fuentes
   - [[https://knightcolumbia.org/content/protocols-not-platforms-a-technological-approach-to-free-speech][Protocols, Not Platforms: A Technological Approach to Free Speech]].
   - [[https://educatedguesswork.org/posts/wei/][The endpoint of Web Environment Integrity is a closed Web]].
   - [[https://www.inkandswitch.com/local-first/][Local-first software: You own your data, in spite of the cloud]].
   - [[https://www.wired.com/story/the-cloud-is-a-prison-can-the-local-first-software-movement-set-us-free/][The Cloud Is a Prison. Can the Local-First Software Movement Set Us Free?]]
   - [[https://www.gyford.com/phil/writing/2013/02/27/our-incredible-journey/][Our Incredible Journey]].
