_posts/2023-08-30-miscelanea-sobre-web-y-redes-sociales.html

<div id="outline-container-org9ae04c2" class="outline-3">
<h3 id="org9ae04c2">Fuentes</h3>
<div class="outline-text-3" id="text-org9ae04c2">
<ul class="org-ul">
<li><a href="https://knightcolumbia.org/content/protocols-not-platforms-a-technological-approach-to-free-speech">Protocols, Not Platforms: A Technological Approach to Free Speech</a>.</li>
<li><a href="https://educatedguesswork.org/posts/wei/">The endpoint of Web Environment Integrity is a closed Web</a>.</li>
<li><a href="https://www.inkandswitch.com/local-first/">Local-first software: You own your data, in spite of the cloud</a>.</li>
<li><a href="https://www.wired.com/story/the-cloud-is-a-prison-can-the-local-first-software-movement-set-us-free/">The Cloud Is a Prison. Can the Local-First Software Movement Set Us Free?</a></li>
<li><a href="https://www.gyford.com/phil/writing/2013/02/27/our-incredible-journey/">Our Incredible Journey</a>.</li>
</ul>

<p>
<br />
</p>
</div>
</div>
</div>
