_posts/2023-08-30-miscelanea-sobre-web-y-redes-sociales.md


### Fuentes

-   [Protocols, Not Platforms: A Technological Approach to Free Speech](https://knightcolumbia.org/content/protocols-not-platforms-a-technological-approach-to-free-speech).
-   [The endpoint of Web Environment Integrity is a closed Web](https://educatedguesswork.org/posts/wei/).
-   [Local-first software: You own your data, in spite of the cloud](https://www.inkandswitch.com/local-first/).
-   [The Cloud Is a Prison. Can the Local-First Software Movement Set Us Free?](https://www.wired.com/story/the-cloud-is-a-prison-can-the-local-first-software-movement-set-us-free/)
-   [Our Incredible Journey](https://www.gyford.com/phil/writing/2013/02/27/our-incredible-journey/).

